k6_output.txt

         /\      Grafana   /ظ╛ظ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ظ╛ظ╛\ 
  /          \   |   (  |  (ظ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load_test.k6.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 100 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  01.0s/30s

running (0m02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  02.0s/30s

running (0m03.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  03.0s/30s

running (0m04.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  04.0s/30s

running (0m05.0s), 100/100 VUs, 2 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  05.0s/30s

running (0m06.0s), 100/100 VUs, 7 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  06.0s/30s

running (0m07.0s), 100/100 VUs, 12 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  07.0s/30s

running (0m08.0s), 100/100 VUs, 17 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  08.0s/30s

running (0m09.0s), 100/100 VUs, 22 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  09.0s/30s

running (0m10.0s), 100/100 VUs, 27 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  10.0s/30s

running (0m11.0s), 100/100 VUs, 33 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  11.0s/30s

running (0m12.0s), 100/100 VUs, 38 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  12.0s/30s

running (0m13.0s), 100/100 VUs, 43 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  13.0s/30s

running (0m14.0s), 100/100 VUs, 48 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  14.0s/30s

running (0m15.0s), 100/100 VUs, 53 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  15.0s/30s

running (0m16.0s), 100/100 VUs, 58 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  16.0s/30s

running (0m17.0s), 100/100 VUs, 63 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  17.0s/30s

running (0m18.0s), 100/100 VUs, 68 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  18.0s/30s

running (0m19.0s), 100/100 VUs, 74 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  19.0s/30s

running (0m20.0s), 100/100 VUs, 79 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  20.0s/30s

running (0m21.0s), 100/100 VUs, 84 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  21.0s/30s

running (0m22.0s), 100/100 VUs, 89 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  22.0s/30s

running (0m23.0s), 100/100 VUs, 95 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  23.0s/30s

running (0m24.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  24.0s/30s

running (0m25.0s), 100/100 VUs, 105 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  25.0s/30s

running (0m26.0s), 100/100 VUs, 110 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  26.0s/30s

running (0m27.0s), 100/100 VUs, 115 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  27.0s/30s

running (0m28.0s), 100/100 VUs, 120 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  28.0s/30s

running (0m29.0s), 100/100 VUs, 125 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  29.0s/30s

running (0m30.0s), 100/100 VUs, 130 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  30.0s/30s

running (0m31.0s), 095/100 VUs, 136 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m32.0s), 090/100 VUs, 141 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m33.0s), 085/100 VUs, 146 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m34.0s), 080/100 VUs, 151 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m35.0s), 075/100 VUs, 156 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m36.0s), 070/100 VUs, 161 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m37.0s), 065/100 VUs, 166 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m38.0s), 060/100 VUs, 171 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m39.0s), 054/100 VUs, 177 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m40.0s), 049/100 VUs, 182 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m41.0s), 044/100 VUs, 187 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m42.0s), 039/100 VUs, 192 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m43.0s), 034/100 VUs, 197 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m44.0s), 029/100 VUs, 202 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m45.0s), 024/100 VUs, 207 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m46.0s), 019/100 VUs, 212 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m47.0s), 014/100 VUs, 217 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m48.0s), 009/100 VUs, 222 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s

running (0m49.0s), 003/100 VUs, 228 complete and 0 interrupted iterations
default ظô [ 100% ] 100 VUs  30s


  ظûê THRESHOLDS 

    http_req_duration
    ظ£ù 'p(95)<1500' p(95)=20.74s

    http_req_failed
    ظ£ô 'rate<0.05' rate=0.00%


  ظûê TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=16.25s min=3.71s med=18.41s max=22.94s p(90)=18.57s p(95)=20.74s
      { expected_response:true }...: avg=16.25s min=3.71s med=18.41s max=22.94s p(90)=18.57s p(95)=20.74s
    http_req_failed................: 0.00%  0 out of 231
    http_reqs......................: 231    4.664834/s

    EXECUTION
    iteration_duration.............: avg=17.25s min=4.71s med=19.41s max=23.94s p(90)=19.58s p(95)=21.74s
    iterations.....................: 231    4.664834/s
    vus............................: 3      min=3        max=100
    vus_max........................: 100    min=100      max=100

    NETWORK
    data_received..................: 549 kB 11 kB/s
    data_sent......................: 19 kB  383 B/s



running (0m49.5s), 000/100 VUs, 231 complete and 0 interrupted iterations
default ظ£ô [ 100% ] 100 VUs  30s
time="2026-06-21T09:37:20+03:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"